#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time    : 2019/10/29 19:29

# 请设计一个dict, 存储你们公司每个人的信息， 信息包含至少姓名、年龄、电话、职位、工资，并提供一个简单的查找接口，用户按你的要求输入要查找的人，你的程序把查到的信息打印出来
company_info = {
    '张文': {'age': 20, '电话': 1325879960, '职位': '行政', '工资': '2000'},
    '李芳': {'age': 21, '电话': 1325879961, '职位': '运营', '工资': '4000'},
    '张倩': {'age': 22, '电话': 1325879962, '职位': '前台', '工资': '1500'},
    '吴三': {'age': 23, '电话': 1325879963, '职位': '销售', '工资': '3050'},
    '刘云': {'age': 24, '电话': 1325879964, '职位': '销售', '工资': '3000'},
    '鲁森': {'age': 25, '电话': 1325879965, '职位': '地推', '工资': '2500'},
    '白鹤': {'age': 26, '电话': 1325879966, '职位': '运营', '工资': '4000'},
    '黑妹': {'age': 27, '电话': 1325879967, '职位': '后厨', '工资': '3000'},
    '大毛': {'age': 28, '电话': 1325879968, '职位': '司机', '工资': '5008'},
    '笨笨': {'age': 32, '电话': 1325879969, '职位': '总监', '工资': '15000'},
}
while True:
    print("输入要查询的方法,输入数字即可  1: 姓名 2 : 工资 --->")
    way = input("输入 1 or 2：")
    if way == '1':
        print("即将按照姓名来查询")
        name = input("输入员工姓名：")
        print(company_info.get(name, '查找的员工不存在,或者已经离职'))
        break
    elif way == '2':
        print("即将按照工资来查询")
        job = input("请输入工资：")
        for i in company_info:
            for v in company_info[i].items():
                if job in v:
                    print(i, company_info[i])
        break
    else:
        print('输入的有问题,查询系统关闭')
        break
